In [73]:
import pandas as pd

def parse_flatten(xml_file, xsl_file):
    with open(xsl_file, 'r') as file:
        xsl = file.read()
        
    df0 = pd.read_xml(xml_file,parser='lxml')
    df = pd.read_xml(xml_file,parser='lxml',stylesheet=xsl)
    
    return df0, df

In [84]:
xml_file = 'nested_example.xml'
xsl_file = 'xsl_example.xml'
xsl_file_original = 'example/xsl_example.xml'

example0, example = parse_flatten(xml_file, xsl_file)
#example0, example_original = parse_flatten(xml_file, xsl_file_original)

In [85]:
example0

        title  author  judgement
0     My book     NaN        NaN
1  Other book     NaN        NaN

In [83]:
example

        title  judgement    author-name
0     My book        NaN        SmithUK
1     My book        NaN   WallaceUK_US
2     My book        NaN        BrownUK
3  Other book        NaN         KingUS
4  Other book        NaN  QueenKentucky

# Work on real dictionary data

In [33]:
xml_file = 'JMdict_sample.xml'
xsl_file = 'JMdict_xsl.xml'

live0, live = parse_flatten(xml_file, xsl_file)

In [34]:
live0

   ent_seq  k_ele  r_ele  sense
0  1631880    NaN    NaN    NaN

In [35]:
live

   ent_seq  k_ele  r_ele  sense
0  1631880    NaN    NaN    NaN

In [ ]:
jmd[jmd['ent_seq']==1431690]